# Reading csv

In [2]:
import pandas as pd
out=pd.read_csv("student.csv")
print(out)

    Name   s_id  Class  Tamil  English  maths  science  social
0   John  101.0     10     98       89     23       56    70.0
1  Emily    NaN     10    100       45     78       45     NaN
2  David  103.0     10     89       72     56       67    89.0

In [12]:
import pandas as pd
f=pd.read_csv("C:\\Users\\swetha\\Desktop\\Student_mark.csv")
pd.DataFrame(f)

  Student_Name   Id  Class  Tamil  English  Maths  Science  Social
0        Priya  101     10   98.0     78.0   86.0     73.0    91.0
1        Nisha  102     10    NaN      NaN    NaN      NaN     NaN
2   VijayKumar  103     10    NaN      NaN    NaN      NaN     NaN
3       Aarthi  104     10    NaN      NaN    NaN      NaN     NaN
4       Sriram  105     10    NaN      NaN    NaN      NaN     NaN
5        Vetri  106     10    NaN      NaN    NaN      NaN     NaN
6      Jositha  107     10    NaN      NaN    NaN      NaN     NaN
7        Varun  108     10    NaN      NaN    NaN      NaN     NaN
8        Tarun  109     10    NaN      NaN    NaN      NaN     NaN

# to_string()

In [2]:
import pandas as pd
out=pd.read_csv("C:\\Users\\swetha\\Desktop\\Student_mark.csv")
print(out.to_string())

  Student_Name   Id  Class  Tamil  English  Maths  Science  Social
0        Priya  101     10   98.0     78.0   86.0     73.0    91.0
1        Nisha  102     10    NaN      NaN    NaN      NaN     NaN
2   VijayKumar  103     10    NaN      NaN    NaN      NaN     NaN
3       Aarthi  104     10    NaN      NaN    NaN      NaN     NaN
4       Sriram  105     10    NaN      NaN    NaN      NaN     NaN
5        Vetri  106     10    NaN      NaN    NaN      NaN     NaN
6      Jositha  107     10    NaN      NaN    NaN      NaN     NaN
7        Varun  108     10    NaN      NaN    NaN      NaN     NaN
8        Tarun  109     10    NaN      NaN    NaN      NaN     NaN

In [4]:
import pandas as pd
pd.read_csv("C:\\Users\\swetha\\Desktop\\Student_mark.csv")
print(pd.options.display.max_rows)

60

# Writing to CSV file using csv.write()

In [19]:
import csv

# Data to be written to the CSV file
data = [
    ['Name', 'Age', 'Country'],
    ['John', 25, 'USA'],
    ['Emily', 30, 'Canada'],
    ['David', 35, 'UK']
]

# Open the CSV file in write mode
file= open('output.csv', 'w', newline='') 
    # Create a CSV writer object
csv_writer = csv.writer(file)
# Write the DataFrame to a CSV file
csv_writer.writerows(data)

In [21]:
import csv

# Data to be written to the CSV file
data = [
    ['Name', 'id', 'Class','Tamil','English','maths','science','social'],
    ['John', 101, '10',98,89,23,56,78],
    ['Emily',102, '10',100,45,78,45,67],
    ['David',103, '10',89,72,56,67,89]
]

# Open the CSV file in write mode
file= open('student.csv', 'w',newline='') 
    # Create a CSV writer object
csv_writer = csv.writer(file)
# Write the DataFrame to a CSV file
csv_writer.writerows(data)

# Using pandas

In [37]:
import pandas as pd

# Data to be written to the CSV file
data = {
    'Name': ['John', 'Emily', 'David'],
    'ID': [25, 30, 35],
    'Class': [10, 10, 10]
}

# Convert data to DataFrame
df = pd.DataFrame(data)

# Write the DataFrame to a CSV file
df.to_csv('output_pandas.csv')
df

    Name  ID  Class
0   John  25     10
1  Emily  30     10
2  David  35     10

# Getting no.of rows only -->nrows parameter

In [32]:
import pandas as pd
pf=pd.read_csv("output_pandas.csv",nrows=2)

pd.DataFrame(pf)

    Name  ID  Class
0   John  25     10
1  Emily  30     10

# Getting how many columns what we want -->usecols paramter

In [34]:
import pandas as pd

col=['Name','Class']
pf=pd.read_csv("output_pandas.csv",usecols=col)

pd.DataFrame(pf)

    Name  Class
0   John     10
1  Emily     10
2  David     10

# Getting only header field

In [48]:
import pandas as pd

# Read only the header row from the CSV file
header = pd.read_csv('student.csv',nrows=0).columns.tolist()

# Print the header
print(header)

['Name', 'id', 'Class', 'Tamil', 'English', 'maths', 'science', 'social']

# Iterating earch Rows

In [54]:
import csv

file=open("student.csv","r")

csv_reader=csv.reader(file)

for row in csv_reader:
    print(row)

['Name', 'id', 'Class', 'Tamil', 'English', 'maths', 'science', 'social']
[]
['John', '101', '10', '98', '89', '23', '56', '78']
[]
['Emily', '102', '10', '100', '45', '78', '45', '67']
[]
['David', '103', '10', '89', '72', '56', '67', '89']
[]

In [2]:
import pandas as pd

pf=pd.read_csv("student.csv")

for index,row in pf.iterrows():
      print(row.to_dict())

{'Name': 'John', 's_id': 101, 'Class': 10, 'Tamil': 98, 'English': 89, 'maths': 23, 'science': 56, 'social': 70}
{'Name': 'Emily', 's_id': 102, 'Class': 10, 'Tamil': 100, 'English': 45, 'maths': 78, 'science': 45, 'social': 67}
{'Name': 'David', 's_id': 103, 'Class': 10, 'Tamil': 89, 'English': 72, 'maths': 56, 'science': 67, 'social': 89}

# Adding new column to existing file

In [5]:
import pandas as pd

#new_coumn=[100,200,300] # values to be inserted in new column

df=pd.read_csv("student.csv")
df['Total']=[100,200,300] # new_column 7
df.to_csv("student.csv",index=False)

# Deleting particular column

In [1]:
import pandas as pd

df=pd.read_csv("student.csv")

df.drop(['Total','social'],axis=1)

KeyError: "['Total'] not found in axis"

# Deleting a row

In [22]:
import pandas as pd

df=pd.read_csv("student.csv")

df.drop(1)

    Name   id  Class  Tamil  English  maths  science  social  Total
0   John  101     10     98       89     23       56      78    100
2  David  103     10     89       72     56       67      89    300

In [32]:
import pandas as pd

file=pd.read_csv("student.csv")
df=pd.DataFrame(file)
df = df[df['Name'] != 'Emily']

# Iterate rows and writing in txt file

In [29]:
import pandas as pd

file = pd.read_csv("student.csv")

output = open("output.txt", 'w')

for index, row in file.iterrows():
    Name = row['Name']
    s_id = row['s_id']
    Tamil=row['Tamil']
    English=row['English']
    maths=row['maths']
    
    total=English+maths
    
    output.write(f"student_name: {Name}, ID: {s_id}, Total:{total}\n")

output.close()

# Using Method

In [32]:
import pandas as pd

def total(row):
    return row['Tamil']+row['English']+row['maths']

file = pd.read_csv("student.csv")

output = open("output.txt", 'w')

for index, row in file.iterrows():
    Name = row['Name']
    s_id = row['s_id']
    Tamil=row['Tamil']
    English=row['English']
    maths=row['maths']
    
    Total=total(row)
    
    output.write(f"student_name: {Name}, ID: {s_id}, Total:{Total}\n")

output.close()

In [26]:
import pandas as pd

def Calculate_Grade(average_marks):
    if average_marks >= 80:
        return 'A'
    elif average_marks >= 70:
        return 'B'
    elif average_marks >= 60:
        return 'C'
    else:
        return 'D'
# Read the CSV file into a DataFrame
df = pd.read_csv("C:\\Users\\swetha\\Desktop\\student_marks.csv")

# Iterate over each row in the DataFrame
for index, row in df.iterrows():
    # Accessing elements of each row by column name
    stu_name = row['stu_name']
    stu_id = row['stu_id']
    stu_class = row['stu_class']
    tam = row['Tam']
    eng = row['Eng']
    maths = row['Maths']
    sci = row['Sci']
    soc = row['Soc']
    
    # Perform calculations or processing
    total_marks = tam + eng + maths + sci + soc
    average_marks = total_marks / 5
   
    
    print(f"Student Name: {stu_name}, Student ID: {stu_id}, Student Class: {stu_class}")
    print(f"Total Marks: {total_marks}, Average Marks: {average_marks}")
    print()

Student Name: Priya, Student ID: 101, Student Class: 10
Total Marks: 429, Average Marks: 85.8

Student Name: Nisha, Student ID: 102, Student Class: 10
Total Marks: 416, Average Marks: 83.2

Student Name: VijayKumar, Student ID: 103, Student Class: 10
Total Marks: 251, Average Marks: 50.2

Student Name: Aarthi, Student ID: 104, Student Class: 10
Total Marks: 281, Average Marks: 56.2

Student Name: Sriram, Student ID: 105, Student Class: 10
Total Marks: 338, Average Marks: 67.6

In [12]:
import pandas as pd
out=pd.read_csv("output_pandas.csv")
df=pd.DataFrame(out)

# Head() -# will display 1st 5 rows

In [13]:
df.head()

     Name  ID  Class  Tamil  English
0    John  25     10     98       67
1   Emily  30     10     65       98
2   David  35     10     56       45
3   vetri  30     10     65       98
4  Johnny  28     10     98       60

In [14]:
df.head(2)

    Name  ID  Class  Tamil  English
0   John  25     10     98       67
1  Emily  30     10     65       98

# tail() -# will display from last row

In [15]:
df.tail()

     Name  ID  Class  Tamil  English
1   Emily  30     10     65       98
2   David  35     10     56       45
3   vetri  30     10     65       98
4  Johnny  28     10     98       60
5  swetha  35     10     56       45

In [16]:
df.tail(3) # display last 3 rows

     Name  ID  Class  Tamil  English
3   vetri  30     10     65       98
4  Johnny  28     10     98       60
5  swetha  35     10     56       45

In [17]:
df.describe()

              ID  Class      Tamil    English
count   6.000000    6.0   6.000000   6.000000
mean   30.500000   10.0  73.000000  68.833333
std     3.937004    0.0  19.778777  24.161264
min    25.000000   10.0  56.000000  45.000000
25%    28.500000   10.0  58.250000  48.750000
50%    30.000000   10.0  65.000000  63.500000
75%    33.750000   10.0  89.750000  90.250000
max    35.000000   10.0  98.000000  98.000000

# df.colums---How many columns

In [18]:
df.columns

Index(['Name', 'ID', 'Class', 'Tamil', 'English'], dtype='object')

# shape ---display rows and columns

In [20]:
df.shape

(6, 5)

# df['col name'] --display single column

In [21]:
df['Name']

0      John
1     Emily
2     David
3     vetri
4    Johnny
5    swetha
Name: Name, dtype: object

In [22]:
df['Name'].head() # first 5 rows using head()

0      John
1     Emily
2     David
3     vetri
4    Johnny
Name: Name, dtype: object

# df[['col1','col2'] == Multiple col --with head() will give no of rows

In [25]:
df[['Name','Tamil']]

     Name  Tamil
0    John     98
1   Emily     65
2   David     56
3   vetri     65
4  Johnny     98
5  swetha     56

In [28]:
df[['Name','Tamil','English']].head(2)

    Name  Tamil  English
0   John     98       67
1  Emily     65       98

In [29]:
df[['Name','Tamil','English']].tail(2)

     Name  Tamil  English
4  Johnny     98       60
5  swetha     56       45

# Slicing

In [30]:
df[1:5]

     Name  ID  Class  Tamil  English
1   Emily  30     10     65       98
2   David  35     10     56       45
3   vetri  30     10     65       98
4  Johnny  28     10     98       60

In [31]:
df[1:5:2]

    Name  ID  Class  Tamil  English
1  Emily  30     10     65       98
3  vetri  30     10     65       98

# Slicing in particular column

In [33]:
df[['Name','Tamil','ID']][1:5]

     Name  Tamil  ID
1   Emily     65  30
2   David     56  35
3   vetri     65  30
4  Johnny     98  28

In [3]:
df[::-1]

    Name   s_id  Class  Tamil  English  maths  science  social
2  David  103.0     10     89       72     56       67    89.0
1  Emily    NaN     10    100       45     78       45     NaN
0   John  101.0     10     98       89     23       56    70.0

# df.loc[1 ]--Single row

In [36]:
df.loc[1]

Name       Emily
ID            30
Class         10
Tamil         65
English       98
Name: 1, dtype: object

# Iterrows()

In [39]:
for index,row in df.iterrows():
    print(index,row)

0 Name       John
ID           25
Class        10
Tamil        98
English      67
Name: 0, dtype: object
1 Name       Emily
ID            30
Class         10
Tamil         65
English       98
Name: 1, dtype: object
2 Name       David
ID            35
Class         10
Tamil         56
English       45
Name: 2, dtype: object
3 Name       vetri
ID            30
Class         10
Tamil         65
English       98
Name: 3, dtype: object
4 Name       Johnny
ID             28
Class          10
Tamil          98
English        60
Name: 4, dtype: object
5 Name       swetha
ID             35
Class          10
Tamil          56
English        45
Name: 5, dtype: object

# row['colname'] --display particular row

In [41]:
for index,row in df.iterrows():
    print(row['Name'])

John
Emily
David
vetri
Johnny
swetha

In [63]:
for index,row in df.iterrows():
    print(row['Name'])

John
Emily
David
vetri
Johnny
swetha

In [62]:
for index,row in df.iterrows():
    print(row['Name'])
    print(row['ID'])
    print("Tamil:",row['Tamil'])

John
25
Tamil: 98
Emily
30
Tamil: 65
David
35
Tamil: 56
vetri
30
Tamil: 65
Johnny
28
Tamil: 98
swetha
35
Tamil: 56

# df.loc[1:4] --acessing multiple rows

In [38]:
df.loc[0:5]

     Name  ID  Class  Tamil  English
0    John  25     10     98       67
1   Emily  30     10     65       98
2   David  35     10     56       45
3   vetri  30     10     65       98
4  Johnny  28     10     98       60
5  swetha  35     10     56       45

# df.loc[] --acessing using condition

In [51]:
df.loc[df['ID']==35]

     Name  ID  Class  Tamil  English
2   David  35     10     56       45
5  swetha  35     10     56       45

In [52]:
df.loc[df['Name']=='swetha']

     Name  ID  Class  Tamil  English
5  swetha  35     10     56       45

In [56]:
df.loc[df['Name']=='John']

   Name  ID  Class  Tamil  English
0  John  25     10     98       67

# Sorting

In [65]:
df.sort_values('Name',ascending=True)

     Name  ID  Class  Tamil  English
2   David  35     10     56       45
1   Emily  30     10     65       98
0    John  25     10     98       67
4  Johnny  28     10     98       60
5  swetha  35     10     56       45
3   vetri  30     10     65       98

# Descening order

In [66]:
df.sort_values('Name',ascending=False)

     Name  ID  Class  Tamil  English
3   vetri  30     10     65       98
5  swetha  35     10     56       45
4  Johnny  28     10     98       60
0    John  25     10     98       67
1   Emily  30     10     65       98
2   David  35     10     56       45

In [69]:
df.sort_values(['Name','Tamil']) # based on tamil mark the name is in ascending order

     Name  ID  Class  Tamil  English
2   David  35     10     56       45
1   Emily  30     10     65       98
0    John  25     10     98       67
4  Johnny  28     10     98       60
5  swetha  35     10     56       45
3   vetri  30     10     65       98

In [71]:
df.sort_values(['Name','Tamil'],ascending=[0,1])

     Name  ID  Class  Tamil  English
3   vetri  30     10     65       98
5  swetha  35     10     56       45
4  Johnny  28     10     98       60
0    John  25     10     98       67
1   Emily  30     10     65       98
2   David  35     10     56       45

# Adding new column----df[' col name ']=0

In [72]:
df['Total']=0

In [73]:
df

     Name  ID  Class  Tamil  English  Total
0    John  25     10     98       67      0
1   Emily  30     10     65       98      0
2   David  35     10     56       45      0
3   vetri  30     10     65       98      0
4  Johnny  28     10     98       60      0
5  swetha  35     10     56       45      0

In [75]:
df['Total']=df['Tamil']+df['English']
df

     Name  ID  Class  Tamil  English  Total
0    John  25     10     98       67    165
1   Emily  30     10     65       98    163
2   David  35     10     56       45    101
3   vetri  30     10     65       98    163
4  Johnny  28     10     98       60    158
5  swetha  35     10     56       45    101

# Remove column-df.drop()

In [76]:
df.drop(columns='Total')

     Name  ID  Class  Tamil  English
0    John  25     10     98       67
1   Emily  30     10     65       98
2   David  35     10     56       45
3   vetri  30     10     65       98
4  Johnny  28     10     98       60
5  swetha  35     10     56       45

In [77]:
df

     Name  ID  Class  Tamil  English  Total
0    John  25     10     98       67    165
1   Emily  30     10     65       98    163
2   David  35     10     56       45    101
3   vetri  30     10     65       98    163
4  Johnny  28     10     98       60    158
5  swetha  35     10     56       45    101

In [81]:
df=df.drop(columns='Total') # permantently delete in dataframe

KeyError: "['Total'] not found in axis"

In [79]:
df

     Name  ID  Class  Tamil  English
0    John  25     10     98       67
1   Emily  30     10     65       98
2   David  35     10     56       45
3   vetri  30     10     65       98
4  Johnny  28     10     98       60
5  swetha  35     10     56       45

# Export to txt

In [6]:
import pandas as pd
df=pd.read_csv("student.csv")
df.to_csv("student.txt",index=False)

# Export to JSON

In [ ]:
import pandas as pd
df=pd.read_csv("student.csv")
df.to_json("student.json")

# Export to HTML

In [10]:
import pandas as pd
df=pd.read_csv("student.csv")
df.to_html("student.html")

# Iterating rows

In [3]:
import pandas as pd
df=pd.read_csv("student.csv")
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='John', s_id=101, Class=10, Tamil=98, English=89, maths=23, science=56, social=70)
Pandas(Index=1, Name='Emily', s_id=102, Class=10, Tamil=100, English=45, maths=78, science=45, social=67)
Pandas(Index=2, Name='David', s_id=103, Class=10, Tamil=89, English=72, maths=56, science=67, social=89)

In [7]:
import pandas as pd
df=pd.read_csv("student.csv")
for key,value in df.iteritems():
    print("key: ",key)
    print("value: \n ",value)

key:  Name
value:
  0     John
1    Emily
2    David
Name: Name, dtype: object
key:  s_id
value:
  0    101
1    102
2    103
Name: s_id, dtype: int64
key:  Class
value:
  0    10
1    10
2    10
Name: Class, dtype: int64
key:  Tamil
value:
  0     98
1    100
2     89
Name: Tamil, dtype: int64
key:  English
value:
  0    89
1    45
2    72
Name: English, dtype: int64
key:  maths
value:
  0    23
1    78
2    56
Name: maths, dtype: int64
key:  science
value:
  0    56
1    45
2    67
Name: science, dtype: int64
key:  social
value:
  0    70
1    67
2    89
Name: social, dtype: int64

# Data_Missing

In [16]:
import pandas as pd
df=pd.read_csv("student.csv")
df['s_id'].isnull().sum()

1

In [17]:
import pandas as pd
df=pd.read_csv("student.csv")
df['s_id'].notnull().sum()

2

In [18]:
import pandas as pd
df=pd.read_csv("student.csv")
fill_null=df.fillna(0)
fill_null

    Name   s_id  Class  Tamil  English  maths  science  social
0   John  101.0     10     98       89     23       56    70.0
1  Emily    0.0     10    100       45     78       45     0.0
2  David  103.0     10     89       72     56       67    89.0

# Replace in name with full name

In [30]:
import pandas as pd
df=pd.read_csv("student.csv")
replace_name=df.replace({'John':'John kumar',
                         'Emily':'Emily priya',
                         'David':'David shan'})
replace_name.head()

          Name   s_id  Class  Tamil  English  maths  science  social
0   John kumar  101.0     10     98       89     23       56    70.0
1  Emily priya    NaN     10    100       45     78       45     NaN
2   David shan  103.0     10     89       72     56       67    89.0

In [5]:
s="Artificial Intelligence"

In [6]:
s[1:-2]

'rtificial Intelligen'

In [7]:
s[1::-1]

'rA'

In [8]:
s[-1:-5:-1]

'ecne'